config.org
#+title: Emax Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Package Management

** Straight

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+end_src

** use-package

#+begin_src emacs-lisp
(straight-use-package 'use-package)
(use-package straight
             :custom (straight-use-package-by-default t))

#+end_src

We need this to fix an issue with `org-file-name-concat` having a void function definition.

#+begin_src emacs-lisp
(straight-use-package 'org)

#+end_src

* General

On macOS we need to specify that we want to use command as meta key.
#+begin_src emacs-lisp
(setq mac-command-modifier 'meta)
#+end_src

We do not want the contents of the clipboard to be overwritten when
pasting something in visual mode.

#+begin_src emacs-lisp
(setq-default evil-kill-on-visual-paste nil)
#+end_src

Make sure to set `evil-want-keybinding' to nil before loading evil or evil-collection.
#+begin_src emacs-lisp
(setq evil-want-keybinding nil)
#+end_src

Unfilling allows us to collapse a paragraph into a line.

#+begin_src emacs-lisp
(use-package unfill)
#+end_src

Make use of the undo tree

#+begin_src emacs-lisp
(use-package undo-tree
  :config
  (global-undo-tree-mode)
  :custom
  (undo-tree-auto-save-history nil))
#+end_src

Easily convert text to title case

#+begin_src emacs-lisp
(use-package titlecase)
#+end_src

To make sure that the locale is set correctly (required by magit), we
use `exec path from shell`.

#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-copy-envs '("LANG" "LC_ALL" "LC_CTYPES")))

#+end_src

Auto revert buffers when they change on disk

#+begin_src emacs-lisp
(global-auto-revert-mode t)
#+end_src

Disable warnings about function redefinition

#+begin_src emacs-lisp
(setq ad-redefinition-action 'accept)
#+end_src

** Writeroom

This mode is nice if we want to focus on a single buffer and have in
the center.

#+begin_src emacs-lisp
(use-package writeroom-mode
  :custom
  (writeroom-fullscreen-effect 'maximized))

#+end_src

** Help

#+begin_src emacs-lisp
(use-package helpful)

#+end_src

** Windowing

Don't resize windows upon popup
#+begin_src emacs-lisp
(setq even-window-sizes nil)
#+end_src

How to display windows.
#+begin_src emacs-lisp
(setq display-buffer-base-action
  '(display-buffer-same-window))
#+end_src

#+begin_src emacs-lisp
(use-package cycle-resize
  :config
  (setq cycle-resize-steps '(75 50 25 50)))

#+end_src

Functions for shrinking and enlarging windows.

#+begin_src emacs-lisp
(defun mk/enlarge-window ()
  (interactive)
  (enlarge-window-horizontally 10)
  (enlarge-window 5))


(defun mk/shrink-window ()
  (interactive)
  (shrink-window-horizontally 10)
  (shrink-window 5))

#+end_src

Functions for splitting windows.

#+begin_src emacs-lisp
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))


#+end_src

Splitting to a terminal.

#+begin_src emacs-lisp
(defun mk/split-to-shell ()
  "If no *shell* buffer exists, one is created using the `shell` function
  and it is displayed in a new window at the ver bottom. If such a window is
  shown already, it is deleted instead."
  (interactive)
  (let ((shell-window (get-buffer-window "*shell*")))
    (if shell-window
       (progn
         (delete-window shell-window))
        (progn
        (split-and-follow-horizontally)
        (evil-window-move-very-bottom)
        (unless (get-buffer "*shell*")
          (shell))
        (switch-to-buffer "*shell*")))))

(defun mk/split-to-shell-fullscreen ()
  (interactive)
  (mk/split-to-shell)
  (delete-other-windows))
#+end_src

* Theme
** Modus

Somehow, setting the org-heading sizes initially does not work, so we
add reload the config whenever we enter org-mode.

#+begin_src emacs-lisp :tangle no
(defun mk/reload-modus-config ()
  (setq modus-themes-region '(bg-only))
  (setq modus-themes-bold-constructs t)
  (setq modus-themes-italic-constructs t)
  (setq modus-themes-syntax '(faint))
  (setq modus-themes-headings
    '((1 . (overline background 1.3))
      (2 . (background 1.2))
      (3 . (bold 1.1))
      (t . (1.05))))
  (setq modus-themes-scale-headings t)
  (setq modus-themes-org-blocks 'tinted-background)
  (load-theme 'modus-operandi t))

(use-package modus-themes
  :init (mk/reload-modus-config)
  :hook (org-mode . mk/reload-modus-config))

#+end_src

** Doom
#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        ;; The following has been disabled as it turned line numbers italic as well.
        doom-themes-enable-italic nil) ; if nil, italics is universally disabled
  (load-theme 'doom-tomorrow-day t)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

** Fonts

Set the default font for everything

#+begin_src emacs-lisp
(set-face-attribute 'default nil
  :family "Roboto Mono"
  :height 150
  :weight 'medium
  :width 'normal)
#+end_src

** Fringe

Nano disables the fringe.  We want it back.

#+begin_src emacs-lisp
  (setq default-frame-alist
        (append (list
                     '(min-height . 1)
                 '(height     . 45)
                     '(min-width  . 1)
                 '(width      . 81)
                 '(vertical-scroll-bars . nil)
                 '(internal-border-width . 24)
                 '(left-fringe    . 5)
                 '(right-fringe   . 5)
                 '(tool-bar-lines . 0)
                 '(menu-bar-lines . 0))))

#+end_src

** Dark/Light Switching

#+begin_src emacs-lisp
  (defun nano-refresh-theme ()
     "Convenience function which refreshes the nano-theme.
   Calls \(nano-faces\) and \(nano-theme\) sequentially."
     (interactive)
     (progn
       (nano-faces)
       (nano-theme)))

   (defcustom nano-theme-var "light"
     "Variable which sets the default startup theme as light or dark.
   Also allows for toggling of the themes. Is set to 'light' by
   'nano-theme-light' and 'dark' by 'nano-theme-dark'.
   Defaults to nil."
     :group 'nano
     :type 'string)

   (defun nano-toggle-theme ()
     "Function to interactively toggle between light and dark nano themes.
   Requires both to be loaded in order to work."
     (interactive)
     (cond ((string= nano-theme-var "light")
            (progn (nano-theme-set-dark)
                   (nano-refresh-theme)
                   (setq nano-theme-var "dark")
                   ;; Make sure org font sizes are updated after refreshing the
                   ;; theme.
                   (font-height-org-mode-hook)))
            ((string= nano-theme-var "dark")
            (progn (nano-theme-set-light)
                   (nano-refresh-theme)
                   (setq nano-theme-var "light")
                   ;; Make sure org font sizes are updated after refreshing the
                   ;; theme.
                   (font-height-org-mode-hook)))
            (t nil)))

  ;; (nano-theme-set-light)
  ;; (nano-refresh-theme)

#+end_src

* UI

** General

#+begin_src emacs-lisp
(tool-bar-mode -1)
(scroll-bar-mode -1)

#+end_src

** Modeline

Use nano-modeline which is at the top.

#+begin_src emacs-lisp
  (use-package nano-modeline
    :init
    (nano-modeline-mode)
    ;; (set-face-attribute 'nano-modeline-active-status-RW nil
    ;;                 :background "#D7D7D7"
    ;;                 :foreground "black"
    ;;                 :overline nil
    ;;                 :underline nil)
    ;;  (set-face-attribute 'nano-modeline-active-status-** nil
    ;;                 :background "#831D71"
    ;;                 :foreground "white"
    ;;                 :overline nil
    ;;                 :underline nil)
  )
#+end_src

Hide the default modeline.

#+begin_src emacs-lisp
  (use-package hide-mode-line
    :init (global-hide-mode-line-mode +1))
#+end_src

** Lines

*** Numbers

#+begin_src emacs-lisp
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
(add-hook 'term-mode-hook (lambda () (display-line-numbers-mode 0)))

#+end_src

*** Spacing

#+begin_src emacs-lisp
(setq-default line-spacing 2)
(setq default-text-properties '(line-spacing 0.2 line-height 1.2))

#+end_src

*** Highlight

#+begin_src emacs-lisp
(global-hl-line-mode 1)

#+end_src

** Delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook (lambda () (rainbow-delimiters-mode))))

#+end_src

** SVG Tags

*** Regex for Org-mode tags

#+begin_src emacs-lisp
(defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
(defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
(defconst day-re "[A-Za-z]\\{2,3\\}")
#+end_src

