init.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(use-package straight
             :custom (straight-use-package-by-default t))

(straight-use-package 'org)

(setq-default evil-kill-on-visual-paste nil)

(use-package unfill)

(use-package undo-tree
  :config
  (global-undo-tree-mode)
  :custom
  (undo-tree-auto-save-history nil))

(use-package titlecase)

(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-copy-envs '("LANG" "LC_ALL" "LC_CTYPES")))

(use-package writeroom-mode
  :custom
  (writeroom-fullscreen-effect 'maximized))

(use-package helpful)

(use-package cycle-resize
  :config
  (setq cycle-resize-steps '(75 50 25 50)))

(defun mk/enlarge-window ()
  (interactive)
  (enlarge-window-horizontally 10)
  (enlarge-window 5))


(defun mk/shrink-window ()
  (interactive)
  (shrink-window-horizontally 10)
  (shrink-window 5))

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))

(defun mk/split-to-shell ()
  "If no *shell* buffer exists, one is created using the `shell` function
  and it is displayed in a new window at the ver bottom. If such a window is
  shown already, it is deleted instead."
  (interactive)
  (let ((shell-window (get-buffer-window "*shell*")))
    (if shell-window
       (progn
         (delete-window shell-window))
        (progn
        (split-and-follow-horizontally)
        (evil-window-move-very-bottom)
        (unless (get-buffer "*shell*")
          (shell))
        (switch-to-buffer "*shell*")))))

(defun mk/split-to-shell-fullscreen ()
  (interactive)
  (mk/split-to-shell)
  (delete-other-windows))

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-tomorrow-day t)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(set-face-attribute 'default nil
  :family "Roboto Mono"
  :height 150
  :weight 'medium
  :width 'normal)

(setq default-frame-alist
      (append (list
                   '(min-height . 1)
               '(height     . 45)
                   '(min-width  . 1)
               '(width      . 81)
               '(vertical-scroll-bars . nil)
               '(internal-border-width . 24)
               '(left-fringe    . 5)
               '(right-fringe   . 5)
               '(tool-bar-lines . 0)
               '(menu-bar-lines . 0))))

(defun nano-refresh-theme ()
   "Convenience function which refreshes the nano-theme.
 Calls \(nano-faces\) and \(nano-theme\) sequentially."
   (interactive)
   (progn
     (nano-faces)
     (nano-theme)))

 (defcustom nano-theme-var "light"
   "Variable which sets the default startup theme as light or dark.
 Also allows for toggling of the themes. Is set to 'light' by
 'nano-theme-light' and 'dark' by 'nano-theme-dark'.
 Defaults to nil."
   :group 'nano
   :type 'string)

 (defun nano-toggle-theme ()
   "Function to interactively toggle between light and dark nano themes.
 Requires both to be loaded in order to work."
   (interactive)
   (cond ((string= nano-theme-var "light")
          (progn (nano-theme-set-dark)
                 (nano-refresh-theme)
                 (setq nano-theme-var "dark")
                 ;; Make sure org font sizes are updated after refreshing the
                 ;; theme.
                 (font-height-org-mode-hook)))
          ((string= nano-theme-var "dark")
          (progn (nano-theme-set-light)
                 (nano-refresh-theme)
                 (setq nano-theme-var "light")
                 ;; Make sure org font sizes are updated after refreshing the
                 ;; theme.
                 (font-height-org-mode-hook)))
          (t nil)))

;; (nano-theme-set-light)
;; (nano-refresh-theme)

(tool-bar-mode -1)
(scroll-bar-mode -1)

(use-package nano-modeline
  :init
  (nano-modeline-mode)
  ;; (set-face-attribute 'nano-modeline-active-status-RW nil
  ;;                 :background "#D7D7D7"
  ;;                 :foreground "black"
  ;;                 :overline nil
  ;;                 :underline nil)
  ;;  (set-face-attribute 'nano-modeline-active-status-** nil
  ;;                 :background "#831D71"
  ;;                 :foreground "white"
  ;;                 :overline nil
  ;;                 :underline nil)
)

(use-package hide-mode-line
  :init (global-hide-mode-line-mode +1))

(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
(add-hook 'term-mode-hook (lambda () (display-line-numbers-mode 0)))

(setq-default line-spacing 2)
(setq default-text-properties '(line-spacing 0.2 line-height 1.2))

(global-hl-line-mode 1)

(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook (lambda () (rainbow-delimiters-mode))))

(defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
(defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
(defconst day-re "[A-Za-z]\\{2,3\\}")
