config.org
*** Progress Visualization

#+begin_src emacs-lisp
(defun svg-progress-percent (value)
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag (concat value "%")
                           nil :stroke 0 :margin 0)) :ascent 'center))

(defun svg-progress-count (value)
  (let* ((seq (mapcar #'string-to-number (split-string value "/")))
         (count (float (car seq)))
         (total (float (cadr seq))))
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ count total) nil
                                    :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag value nil
                           :stroke 0 :margin 0)) :ascent 'center)))

#+end_src

*** Setup

By specifying `:tangle no` on this block, we disable it.

#+begin_src emacs-lisp :tangle no
(use-package svg-tag-mode
   :ensure t
   :init
   (setq svg-tag-tags
        `(
          ;; Org tags
          ;; (":\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
          ;; (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

          ;; Task priority
          ("\\[#[A-Z]\\]" . ( (lambda (tag)
                                (svg-tag-make tag :face 'org-priority 
                                              :beg 2 :end -1 :margin 0))))

          ;; Progress
          ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
                                              (svg-progress-percent (substring tag 1 -2)))))
          ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
                                            (svg-progress-count (substring tag 1 -1)))))

          ;; TODO / DONE
          ("TODO" . ((lambda (tag) (svg-tag-make "TODO" :face 'org-todo :inverse t :font-size 14.0 :margin 0))))
          ("LATER" . ((lambda (tag) (svg-tag-make "LATER" :face 'org-todo :inverse t :font-size 14.0 :margin 0))))
          ("WAITING" . ((lambda (tag) (svg-tag-make "WAITING" :face 'org-todo :inverse t :font-size 14.0 :margin 0))))
          ("NEXT" . ((lambda (tag) (svg-tag-make "NEXT" :face 'org-todo :inverse t :font-size 14.0 :margin 0))))
          ("DONE" . ((lambda (tag) (svg-tag-make "DONE" :face 'org-done :font-size 14.0 :margin 0))))
          ("\\todo" . ((lambda (tag) (svg-tag-make "TODO" :radius 3 :inverse t :font-size 14.0))))


          ;; Citation of the form [cite:@Knuth:1984] 
          ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
                                            (svg-tag-make tag
                                                          :inverse t
                                                          :beg 7 :end -1
                                                          :crop-right t))))
          ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
                                                  (svg-tag-make tag
                                                                :end -1
                                                                :crop-left t))))


          ;; Active date (variants with/without day name, with/without time)
          (,(format "\\(<%s>\\)" date-re) .
           ((lambda (tag)
              (svg-tag-make tag :beg 1 :end -1 :font-size 14.0 :margin 0))))
          (,(format "\\(<%s %s>\\)" date-re day-re) .
           ((lambda (tag)
              (svg-tag-make tag :beg 1 :end -1 :inverse nil :font-size 14.0 :margin 0))))
          (,(format "\\(<%s %s *\\)%s>" date-re day-re time-re) .
           ((lambda (tag)
              (svg-tag-make tag :beg 1 :inverse nil :crop-right t :font-size 14.0 :margin 0))))
          (,(format "<%s %s *\\(%s>\\)" date-re day-re time-re) .
           ((lambda (tag)
              (svg-tag-make tag :end -1 :inverse t :crop-left t :font-size 14.0 :margin 0))))

          ;; Inactive date  (without day name, with or without time)
           (,(format "\\(\\[%s\\]\\)" date-re) .
            ((lambda (tag)
               (svg-tag-make tag :beg 1 :end -1 :font-size 14.0 :margin 0 :face 'org-date))))
           (,(format "\\(\\[%s %s *\\)%s\\]" date-re day-re time-re) .
            ((lambda (tag)
               (svg-tag-make tag :beg 1 :inverse nil :crop-right t :font-size 14.0 :margin 0 :face 'org-date))))
           (,(format "\\[%s %s *\\(%s\\]\\)" date-re day-re time-re) .
            ((lambda (tag)
               (svg-tag-make tag :end -1 :inverse t :crop-left t :font-size 14.0 :margin 0 :face 'org-date)))))) 
  :hook ((prog-mode textmode) . (svg-tag-mode t)))
#+end_src

* Completion

** Counsel

#+begin_src emacs-lisp
(use-package counsel)

#+end_src

** ivy

#+begin_src emacs-lisp
(use-package ivy
  :config
  (ivy-mode)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t))

(use-package ivy-rich
  :config
  (ivy-rich-mode 1))

#+end_src

** amx

#+begin_src emacs-lisp
(use-package amx
  :config
  (amx-mode))

#+end_src

** Company

#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . (lambda ()
           (setq company-backend 'company-lsp)
           (company-mode)))
  :config
  ;; Display completions after entering 2 characters
  (setq company-minimum-prefix-length 2)
  ;; Merge several company backends.
  (add-to-list 'company-backends '(company-capf :with company-ispell company-lsp company-dabbrev :separate)))
#+end_src

** Parentheses

#+begin_src emacs-lisp
 (use-package smartparens
   :config
   (sp-pair "$" "$")
   (smartparens-global-mode t))

#+end_src

** Spelling

The default spell checker should be aspell.

#+begin_src emacs-lisp
(setq-default ispell-program-name "aspell")
#+end_src

Use popups to correct spelling mistakes.

#+begin_src emacs-lisp
(use-package flyspell-correct
  :after flyspell)
(use-package flyspell-popup
  :after flyspell-correct)

#+end_src

#+begin_src emacs-lisp
(dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))

#+end_src

The default language should be english.

#+begin_src emacs-lisp
(setq-default ispell-dictionary "english")

#+end_src

** Goodies

Allows us to quickly insert the current date.

#+begin_src emacs-lisp
(defun insert-current-date () (interactive)
    (insert (shell-command-to-string "echo -n $(date +%Y-%m-%d)")))

#+end_src

Simple function that allows inserting characters. Useful for shortcuts
related to Umlaut-characters.

#+begin_src emacs-lisp
(defun mk/insert-character (char)
  (interactive)
  (insert char))
#+end_src

Package for changing accents after writing letters.

#+begin_src emacs-lisp
(use-package accent
  :config
  (setq accent-position 'after))
#+end_src

* Git

** Magit

#+begin_src emacs-lisp
(use-package magit)
(use-package magit-delta)
(use-package magit-todos)

#+end_src

Enable `delta` mode automatically.

#+begin_src emacs-lisp
(add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))

#+end_src

** Gutter

#+begin_src emacs-lisp
(use-package git-gutter
  :config
  (add-hook 'prog-mode-hook (lambda () (git-gutter-mode)))
  (add-hook 'TeX-mode-hook (lambda () (git-gutter-mode)))
  (setq git-gutter:update-interval 0.02))

(use-package git-gutter-fringe
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom)
  (set-face-foreground 'git-gutter-fr:modified "dodger blue")
  (set-face-foreground 'git-gutter-fr:added    "sea green")
  (set-face-foreground 'git-gutter-fr:deleted  "red2"))

#+end_src

* Files and Projects

** Projectile

#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-mode +1))

#+end_src

** Dired

Hide dot-files by default and setup better evil keybindings.

#+begin_src emacs-lisp
(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
  "H" 'dired-hide-dotfiles-mode
  "h" 'dired-up-directory
  "l" 'dired-find-file
  (kbd "SPC") 'counsel-M-x))

#+end_src


Improve how dired buffers are displayed.

#+begin_src emacs-lisp
(when (string= system-type "darwin")
  (setq dired-use-ls-dired t
        ;; On M1 Macs this needs to be /opt/homebrew/bin/gls.
        insert-directory-program "/usr/local/bin/gls"
        dired-listing-switches "-agBhlo --group-directories-first"))

#+end_src

Use dirvish as dired alternative.

#+begin_src emacs-lisp
(use-package dirvish
  :config
  (dirvish-override-dired-mode 1))
#+end_src

Configure that certain files are opened externally.

#+begin_src emacs-lisp
(straight-use-package
  '(openwith :type git :host github :repo "garberw/openwith"))
(require 'openwith)
(setq openwith-associations
  (list
    '("\\.ipe" "/Applications/Ipe.app/Contents/MacOS/ipe" (file))
    '("\\.pdf" "/Applications/Skim.app/Contents/MacOS/Skim" (file))))
(openwith-mode 1)
#+end_src

** Search
#+begin_src emacs-lisp
(use-package rg)
#+end_src

* Programming
** Bazel

#+begin_src emacs-lisp
(use-package bazel
  :config
  (setq bazel-buildifier-before-save t))

#+end_src

** C++

#+begin_src emacs-lisp
(use-package cc-mode)
(use-package clang-format)
(use-package cpp-auto-include)

(add-hook 'c++-mode-hook (lambda ()
                           (setq lsp-ui-doc-mode -1)
                           (require 'clang-format)
                           (require 'cpp-auto-include)))

#+end_src

** CSV

Enable CSV alignment by default.

#+begin_src emacs-lisp
(add-hook 'csv-mode-hook (lambda ()
  (csv-align-mode)))
#+end_src

** elm

#+begin_src emacs-lisp
(use-package elm-mode)

#+end_src

Enable formatting on save

#+begin_src emacs-lisp
(add-hook 'elm-mode-hook (lambda ()
                           (lsp-ui-doc-mode -1)
                           (elm-format-on-save-mode 1)))
#+end_src

** JavaScript

General JavaScript support

#+begin_src emacs-lisp
(use-package js2-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode)))

#+end_src

Support JavaScript imports

#+begin_src emacs-lisp
(use-package import-js)

#+end_src

Support for formatting of JavaScript code

#+begin_src emacs-lisp
(use-package prettier-js
  :after js2-mode
  :hook (js2-mode . prettier-js-mode))

#+end_src

** Jupyter

#+begin_src emacs-lisp
(use-package ein
  :init
  (setq ein:output-area-inlined-images t))
#+end_src

