init.el

(defun svg-progress-percent (value)
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag (concat value "%")
                           nil :stroke 0 :margin 0)) :ascent 'center))

(defun svg-progress-count (value)
  (let* ((seq (mapcar #'string-to-number (split-string value "/")))
         (count (float (car seq)))
         (total (float (cadr seq))))
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ count total) nil
                                    :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag value nil
                           :stroke 0 :margin 0)) :ascent 'center)))

(use-package counsel)

(use-package ivy
  :config
  (ivy-mode)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t))

(use-package ivy-rich
  :config
  (ivy-rich-mode 1))

(use-package amx
  :config
  (amx-mode))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . (lambda ()
           (setq company-backend 'company-lsp)
           (company-mode))))

(use-package smartparens
  :config
  (sp-pair "$" "$")
  (smartparens-global-mode t))

(setq-default ispell-program-name "aspell")

(use-package flyspell-correct
  :after flyspell)
(use-package flyspell-popup
  :after flyspell-correct)

(dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))

(setq-default ispell-dictionary "english")

(defun insert-current-date () (interactive)
    (insert (shell-command-to-string "echo -n $(date +%Y-%m-%d)")))

(defun mk/insert-character (char)
  (interactive)
  (insert char))

(use-package accent
  :config
  (setq accent-position 'after))

(use-package magit)
(use-package magit-delta)
(use-package magit-todos)

(add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))

(use-package git-gutter
  :config
  (add-hook 'prog-mode-hook (lambda () (git-gutter-mode)))
  (add-hook 'TeX-mode-hook (lambda () (git-gutter-mode)))
  (setq git-gutter:update-interval 0.02))

(use-package git-gutter-fringe
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom)
  (set-face-foreground 'git-gutter-fr:modified "dodger blue")
  (set-face-foreground 'git-gutter-fr:added    "sea green")
  (set-face-foreground 'git-gutter-fr:deleted  "red2"))

(use-package projectile
  :config
  (projectile-mode +1))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
  "H" 'dired-hide-dotfiles-mode
  "h" 'dired-up-directory
  "l" 'dired-find-file
  (kbd "SPC") 'counsel-M-x))

(when (string= system-type "darwin")
  (setq dired-use-ls-dired t
        ;; On M1 Macs this needs to be /opt/homebrew/bin/gls.
        insert-directory-program "/usr/local/bin/gls"
        dired-listing-switches "-agBhlo --group-directories-first"))

(use-package dirvish
  :config
  (dirvish-override-dired-mode 1))

(straight-use-package
  '(openwith :type git :host github :repo "garberw/openwith"))
(require 'openwith)
(setq openwith-associations
  (list
    '("\\.ipe" "/Applications/Ipe.app/Contents/MacOS/ipe" (file))
    '("\\.pdf" "/Applications/Skim.app/Contents/MacOS/Skim" (file))))
(openwith-mode 1)

(use-package bazel
  :config
  (setq bazel-buildifier-before-save t))

(use-package cc-mode)
(use-package clang-format)
(use-package cpp-auto-include)

(add-hook 'c++-mode-hook (lambda ()
                           (setq lsp-ui-doc-mode -1)
                           (require 'clang-format)
                           (require 'cpp-auto-include)))

(add-hook 'csv-mode-hook (lambda ()
  (csv-align-mode)))

(use-package elm-mode)

(add-hook 'elm-mode-hook (lambda ()
                           (lsp-ui-doc-mode -1)
                           (elm-format-on-save-mode 1)))

(use-package js2-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode)))

(use-package import-js)

(use-package prettier-js
  :after js2-mode
  :hook (js2-mode . prettier-js-mode))

(use-package ein
  :init
  (setq ein:output-area-inlined-images t))

(straight-use-package 'auctex)
