config.org
** LaTeX

Somehow setting up auctex with use-package did not work, so we do it
via straight instead.

#+begin_src emacs-lisp
(straight-use-package 'auctex)
(use-package ivy-bibtex)

#+end_src

Setting up the TeX distribution

#+begin_src emacs-lisp
(setenv "PATH" (concat (getenv "PATH") ":/Library/TeX/texbin/"))
(setq exec-path (append exec-path '("/Library/TeX/texbin/")))

#+end_src

Open the error overview after building.

#+begin_src emacs-lisp
(setq TeX-error-overview-open-after-TeX-run t)

#+end_src

Setup Synctex

#+begin_src emacs-lisp
(setq TeX-source-correlate-mode t)
(setq TeX-source-correlate-start-server t)
(setq TeX-source-correlate-method 'synctex)

#+end_src

PDF Output

#+begin_src emacs-lisp
(setq TeX-view-program-list
      '(("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))
(setq TeX-view-program-selection '((output-pdf "Skim")))

#+end_src

We want a smaller fill-column than usual in latex mode.

#+begin_src emacs-lisp
(add-hook 'TeX-mode-hook (lambda ()
                           (lsp-ui-doc-mode -1)
                           (setq fill-column 70)))

#+end_src

Sentences should end with double spaces.

#+begin_src emacs-lisp
(setq sentence-end-double-space t)

#+end_src

*** Bibtex

#+begin_src emacs-lisp
(use-package org-ref)

#+end_src

We use a custom function for Bibtex key generation.

#+begin_src emacs-lisp
(require 'cl-lib)
(setq bibtex-autokey-before-presentation-function
  (lambda
    (key)
    (concat
     (seq-subseq key 0
                 (cl-search "-" key))
     "-"
     (seq-subseq key
             (+
              ;; TODO: We need to handle the case where we get nil here.
              (cl-search "-" key)
              4))
     "-"
     (seq-subseq key
             (+
              ;; TODO: We need to handle the case where we get nil here.
              (cl-search "-" key)
              1)
             (+
              ;; TODO: We need to handle the case where we get nil here.
              (cl-search "-" key)
              3)))))

(setq bibtex-autokey-name-length -1)
(setq bibtex-autokey-name-year-separator "-")
(setq bibtex-autokey-names 3)
(setq bibtex-autokey-names-stretch 1)
(setq bibtex-autokey-titleword-length -1)
(setq bibtex-autokey-titleword-separator "")
(setq bibtex-autokey-year-title-separator "-")

#+end_src

Enable line numbers in Bibtex mode by default.

#+begin_src emacs-lisp
(add-hook 'bibtex-mode-hook (lambda ()
                              (display-line-numbers-mode)
                              (setq display-line-numbers 'relative)))

#+end_src

Enable Reftex in AUCTeX

#+begin_src emacs-lisp
;; Fixes an issue where reftex won't search/find the bib-file initially.
(add-hook 'TeX-mode-hook (lambda ()
   (turn-on-reftex)
   (reftex-parse-all)))

#+end_src

Enable a nice interface between RefTeX and AUCTeX

#+begin_src emacs-lisp
(setq reftex-plug-into-AUCTeX t)

#+end_src

Tell RefTeX where it should look for bib files.

#+begin_src emacs-lisp
(setq reftex-external-file-finders
      '(("tex" . "kpsewhich -format=.tex %f")
        ("bib" . "kpsewhich -format=.bib %f")))
(setq reftex-use-external-file-finders t)

#+end_src

Automatically include a tilde `~` before a citation.

#+begin_src emacs-lisp
(setq reftex-format-cite-function 
  '(lambda (key fmt)
     (let ((cite (replace-regexp-in-string "%l" key fmt)))
       (if (or (= ?~ (string-to-char fmt))
               (member (preceding-char) '(?\ ?\t ?\n ?~ ?{ ?,))
               (member (following-char) '(?} ))
     )
           cite
         (concat "~" cite)))))

#+end_src

*** LatexMk

#+begin_src emacs-lisp
(use-package auctex-latexmk
  :config
  (setq auctex-latexmk-inherit-TeX-PDF-mode t)
  (auctex-latexmk-setup)
  (setq TeX-command-default "LatexMk")
  (setq latex-build-command "LatexMk"))

#+end_src

A nice build command that uses LatexMk

#+begin_src emacs-lisp
(defun latex/build ()
  (interactive)
  (progn
    (let ((TeX-save-query nil))
      (TeX-save-document (TeX-master-file)))
    (TeX-command latex-build-command 'TeX-master-file -1)))

#+end_src

Functions to change latex font environments (bold, emphasis, etc.)

#+begin_src emacs-lisp
(defun latex/font-bold () (interactive) (TeX-font nil ?\C-b))
(defun latex/font-medium () (interactive) (TeX-font nil ?\C-m))
(defun latex/font-code () (interactive) (TeX-font nil ?\C-t))
(defun latex/font-emphasis () (interactive) (TeX-font nil ?\C-e))
(defun latex/font-italic () (interactive) (TeX-font nil ?\C-i))
(defun latex/font-clear () (interactive) (TeX-font nil ?\C-d))
(defun latex/font-calligraphic () (interactive) (TeX-font nil ?\C-a))
(defun latex/font-small-caps () (interactive) (TeX-font nil ?\C-c))
(defun latex/font-sans-serif () (interactive) (TeX-font nil ?\C-f))
(defun latex/font-normal () (interactive) (TeX-font nil ?\C-n))
(defun latex/font-serif () (interactive) (TeX-font nil ?\C-r))
(defun latex/font-oblique () (interactive) (TeX-font nil ?\C-s))
(defun latex/font-upright () (interactive) (TeX-font nil ?\C-u))

#+end_src

** LSP

#+begin_src emacs-lisp
(use-package lsp-mode
  :ensure t
  :defer t
  :init
  (setq lsp-keep-workspace-alive nil
        lsp-signature-doc-lines 5
        ;; lsp-idle-delay 1
        lsp-prefer-capf t)
  :config
  (advice-add #'lsp--auto-configure :override #'ignore))

(straight-use-package 'lsp-ui)
(straight-use-package 'lsp-ivy)

#+end_src

LSP requies YASnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :after lsp-mode)
#+end_src

We don't want breadcrumbs and no tips on mouse over.

#+begin_src emacs-lisp
(setq lsp-headerline-breadcrumb-enable nil)
(setq lsp-ui-doc-show-with-mouse nil)
(setq lsp-enable-completion-at-point nil) ;; To fix a bug where multiple completion systems get triggered.

#+end_src

Enable LSP in different modes.

#+begin_src emacs-lisp
(add-hook 'TeX-mode-hook #'lsp)
(add-hook 'ess-r-mode-hook #'lsp)
(add-hook 'elm-mode-hook #'lsp)
(add-hook 'python-mode-hook #'lsp)
(add-hook 'c++-mode-hook #'lsp)
(add-hook 'js2-mode-hook #'lsp)

#+end_src

** Markdown

#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))

#+end_src

Preview

#+begin_src emacs-lisp
(use-package markdown-preview-mode)

#+end_src

** Protobuf

#+begin_src emacs-lisp
(use-package protobuf-mode)

#+end_src

** Python

#+begin_src emacs-lisp
(use-package python-mode)

(use-package company-jedi)
(use-package lsp-pyright)
(use-package importmagic)
(use-package yapfify)

(add-hook 'python-mode-hook (lambda ()
                              (define-key python-mode-map (kbd "<backspace>") nil) ;; fixes an issue where backspace would not work in python mode
                              (setq lsp-headerline-breadcrumb-enable nil)
                              (setq lsp-ui-doc-mode -1)
                              (require 'importmagic)
                              (require 'company-jedi)
                              (require 'yapfify)
                              (yapf-mode)))

(setq lsp-enable-file-watchers nil)
#+end_src

** R

#+begin_src emacs-lisp
(use-package ess)
(use-package ess-view-data)

#+end_src

Set LSP backend and disable ui-doc-mode since that interferes with our
window manager.

#+begin_src emacs-lisp
(setq ess-r-backend 'lsp)

(add-hook 'ess-r-mode-hook (lambda ()
                             (lsp-ui-doc-mode -1)))

#+end_src

* Org

Enable org-indent-mode for nicer indentation

#+begin_src emacs-lisp
(defun mk/org-mode-setup ()
  (auto-fill-mode)
  (org-indent-mode))

(use-package org
  :hook (org-mode . mk/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"))

#+end_src

Custom heights for org-mode section titles.

#+begin_src emacs-lisp
(defun font-height-org-mode-hook ()
  "Stop the org-level headers from increasing in height relative to the other text."
  (set-face-attribute 'org-level-1 nil :height 1.5)
  (set-face-attribute 'org-level-2 nil :height 1.2))
(add-hook 'org-mode-hook #'font-height-org-mode-hook)

#+end_src

Utilize a more modern look for org-mode.

#+begin_src emacs-lisp
(use-package org-modern
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda)))
#+end_src

Disable folding of double empty lines.

#+begin_src emacs-lisp
(setq org-cycle-separator-lines -2)

#+end_src

Use tempo to automatically extend shortcuts into src blocks. (e.g.,
type "<el" and hit TAB)

#+begin_src emacs-lisp
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("bib" . "src bibtex"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("tex" . "src latex"))
(add-to-list 'org-structure-template-alist '("ein" . "src ein-python :session localhost"))
(add-to-list 'org-structure-template-alist '("r" . "src R :session :exports both results output org"))

#+end_src

Functions for quick access to specific TODO lists.

#+begin_src emacs-lisp
(defun org-todo-list-LATER ()
  (interactive)
  (org-todo-list "LATER"))

(defun org-todo-list-NEXT ()
  (interactive)
  (org-todo-list "NEXT"))

(defun org-todo-list-TODO ()
  (interactive)
  (org-todo-list "TODO"))

(defun org-todo-list-WAITING ()
  (interactive)
  (org-todo-list "WAITING"))

(defun org-agenda-BOARD ()
  (interactive)
  (org-agenda nil "w"))

#+end_src

