config.org
** Roam

We tell org-roam to store all documents in `~/Documents/org-roam` and
overwrite the default template such that logging is disabled and latex
previews are rendered by default. (`Logging` here refers to the
logging of state changes, e.g., when a TODO is changed to DONE.)

#+begin_src emacs-lisp
(use-package org-roam
  :config
  (setq org-roam-directory (file-truename "~/Documents/org-roam"))
  (org-roam-db-autosync-mode)

  ;; Overwrite default capture template
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :target (file+head "${slug}.org" ":PROPERTIES:\n:ID: %(org-id-new)\n:LOGGING: nil\n:END:\n#+title: ${title}\n")
           :unnarrowed t)
          ))
  )

#+end_src

** Agenda

A function that allows us to tell org-agenda to rescan the files in
our org-roam directory.

#+begin_src emacs-lisp
(defun org-agenda-refresh ()
  (interactive)
  (setq org-agenda-files (directory-files-recursively "~/Documents/org-roam/" "\\.org$")))
(org-agenda-refresh)

#+end_src

Warn 14 days before a deadline.

#+begin_src emacs-lisp
(setq org-deadline-warning-days 14)

#+end_src

The TODO keywords we want to work with

#+begin_src emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "|" "DONE(d!)")
        (sequence "LATER(l)" "NEXT(n)" "WAITING(w)" "ACTIVE(a)" "|" "COMPLETED(c)")))

#+end_src

Start week on mondays

#+begin_src emacs-lisp
(setq org-agenda-start-on-weekday 1)
(setq calendar-week-start-day 1)

#+end_src

A custom agenda view that presents a nice sorted dashboard

#+begin_src emacs-lisp
(setq org-agenda-custom-commands
 '(("w" "Workflow Status"
    ((todo "NEXT"
          ((org-agenda-overriding-header "Things to do next")
           (org-agenda-todo-list-sublevels nil)
           (org-agenda-files org-agenda-files)))
     (todo "TODO"
          ((org-agenda-overriding-header "Not pressing")
           (org-agenda-files org-agenda-files)))
     (todo "WAITING"
          ((org-agenda-overriding-header "Waiting for External")
           (org-agenda-files org-agenda-files)))
     (todo "LATER"
          ((org-agenda-overriding-header "Backlog")
           (org-agenda-files org-agenda-files))) 
    ))))

#+end_src

** Evil-org

Use evil in org-mode

#+begin_src emacs-lisp
(use-package evil-org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (evil-org-set-key-theme '(navigation insert textobjects additional calendar))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

#+end_src

Prevent TAB issues when using evil-org from terminal.

#+begin_src emacs-lisp
(setq evil-want-C-i-jump nil)

#+end_src

** Babel

Allows us to execute code in src blocks within org documents.  We
specify for which languages we want to have this enabled.

#+begin_src emacs-lisp
(org-babel-do-load-languages
  'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t)
      (ein . t)
      (R . t)))

#+end_src

Allow code execution in org files.

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src

We want the `config.org` file to be tangled by babel automatically.

#+begin_src emacs-lisp
(defun mk/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))
(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mk/org-babel-tangle-config)))

#+end_src

** Org-Bullets

A nicer way to display the bullets in org-mode.

#+begin_src emacs-lisp
(use-package org-bullets
  :init
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-bullets-bullet-list '("▶" "▷" "◉" "○")))

#+end_src

** Calendar

#+begin_src emacs-lisp
(use-package calfw)
(use-package calfw-org)

#+end_src

Use nicer unicode characters to display the calendar outlines.

#+begin_src emacs-lisp
(setq cfw:fchar-junction ?╋
      cfw:fchar-vertical-line ?┃
      cfw:fchar-horizontal-line ?━
      cfw:fchar-left-junction ?┣
      cfw:fchar-right-junction ?┫
      cfw:fchar-top-junction ?┯
      cfw:fchar-top-left-corner ?┏
      cfw:fchar-top-right-corner ?┓)

#+end_src

Open week view by default.

#+begin_src emacs-lisp
(defun my--cfw:open-calendar-buffer-view (orig-func &rest args &allow-other-keys)
  (apply orig-func :view 'week :allow-other-keys t args)
  )
(advice-add 'cfw:open-calendar-buffer :around #'my--cfw:open-calendar-buffer-view)

#+end_src

** Latex Previews

The `org-fragtog` package allows us to render latex previews right
after we typed the code.

#+begin_src emacs-lisp
(use-package org-fragtog
  :config
  (add-hook 'org-mode-hook 'org-fragtog-mode))

#+end_src

Increase the font-size of latex previews.

#+begin_src emacs-lisp
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))

#+end_src

** Notifications

TODO: This is not working yet.  Also, when enabled, leads to freezes
and random popups of the agenda buffer.

#+begin_src emacs-lisp
  ;; (use-package org-notifications
  ;;   :config
  ;;   (org-notifications-start))

#+end_src

* Keybindings
** General

We want to use Alt/Option-Backspace to delete words.

#+begin_src emacs-lisp
(setq mac-option-modifier 'alt)
(global-set-key (kbd "A-<backspace>") 'backward-kill-word)

#+end_src

Make ESC quit prompts

#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

** Evil

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-keybinding nil) ;; Required for evil-collection
  (setq evil-want-visual-char-semi-exclusive t)
  :config
  (evil-mode 1)
  ;; Tell evil to use undo-tree
  (evil-set-undo-system 'undo-tree))

#+end_src

To allow evil bindings throughout emacs, e.g., also in magit, we use
evil-collection.

#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

#+end_src

Evil-surround allows us to surround a selection with characters.

#+begin_src emacs-lisp
(use-package evil-surround
  :config
  (global-evil-surround-mode 1)
  (evil-define-key 'visual global-map "s" 'evil-surround-region))

#+end_src

Evil-exchange can be used to swap selections.

#+begin_src emacs-lisp
(use-package evil-exchange
  :config
  (evil-exchange-install))

#+end_src

Evil-matchit to be able to jump between tags (e.g. begin/end in LaTeX)

#+begin_src emacs-lisp
(use-package evil-matchit
  :init
  (global-evil-matchit-mode 1))
#+end_src

** Which Key

Shows a an overview of the currently available keybindings.

#+begin_src emacs-lisp
(use-package which-key
  :config
  (which-key-setup-minibuffer)
  (which-key-mode))

#+end_src

** iedit

Lets us edit in multiple places in a buffer at once.

#+begin_src emacs-lisp
(use-package iedit
  :config
  (straight-use-package 'evil-iedit-state)
  (require 'evil-iedit-state))

#+end_src

** Search

We want to use swiper for search

#+begin_src emacs-lisp
(define-key evil-normal-state-map "/" 'swiper)

;; Somehow previous and next need to be swapped here.
(define-key evil-motion-state-map "n" 'evil-search-previous)
(define-key evil-motion-state-map "N" 'evil-search-next)

#+end_src

** Hydra

Allows us to define our own transient states.

#+begin_src emacs-lisp
(use-package hydra)

#+end_src

** Space Mode

Allows us to use SPC for all kinds of actions, just like spacemacs.

#+begin_src emacs-lisp
(use-package dash)
(use-package general)
(use-package bind-map)
(use-package bind-key)
(straight-use-package
 '(spaceleader :type git :host github :repo "mohkale/spaceleader"))

#+end_src

** Bindings

#+begin_src emacs-lisp
(leader-set-keys
  "TAB" '(switch-to-last-buffer+ :wk "last-buffer")
  "SPC" '(counsel-M-x :wk "M-x")
  "<escape>" 'abort-recursive-edit
  "DEL"      'exit-recursive-edit
)

(define-key company-mode-map (kbd "<tab>") 'completion-at-point)

#+end_src

*** Applications

#+begin_src emacs-lisp
(leader-set-keys
  "a" '(:ignore t :wk "applications")
  "ad" 'dired-jump
)

#+end_src

*** Bazel

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'bazel-mode "=" 'bazel-buildifier)

#+end_src

*** Bibtex

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'bibtex-mode "s" 'org-ref-sort-bibtex-entry)
(leader-set-keys-for-major-mode 'bibtex-mode "c" 'bibtex-clean-entry)

#+end_src

*** Buffers

#+begin_src emacs-lisp
(defun create-scratch-buffer nil
   "create a scratch buffer"
   (interactive)
   (switch-to-buffer (get-buffer-create "*scratch*")))
   ;; (lisp-interaction-mode))        

(leader-set-keys
  "b" '(:ignore t :wk "buffers")
  "bb" 'switch-to-buffer
  "bd" 'kill-this-buffer
  "bm" 'buffer-menu
  "bn" 'next-buffer
  "bp" 'previous-buffer
  "bs" 'create-scratch-buffer
  "br" 'revert-buffer
)

#+end_src

*** Comments

#+begin_src emacs-lisp
(defun comment-beginning-of-line ()
  (interactive)
  (comment-line 1)
  (previous-line))

(leader-set-keys
  "c" '(:ignore t :wk "comment")
  "cl" 'comment-beginning-of-line
)

#+end_src

*** C++

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'c++-mode "gd" 'lsp-find-definition)
(leader-set-keys-for-major-mode 'c++-mode "=" 'lsp-format-buffer)

#+end_src

*** Evaluation

#+begin_src emacs-lisp
(leader-set-keys
  "e" '(:ignore t :wk "eval")
  "es" 'eval-last-sexp
)

#+end_src

*** Files

#+begin_src emacs-lisp
(defun mk/find-user-init-file ()
  (interactive)
  (find-file (expand-file-name "~/.emacs.d/config.org")))

(leader-set-keys
  "f" '(:ignore t :wk "files")
  "ff" 'counsel-find-file
  "fc" 'copy-file
  "fh" 'find-file-at-point
  "fed" 'mk/find-user-init-file
)

#+end_src

*** Git

#+begin_src emacs-lisp
(leader-set-keys
  "g" '(:ignore t :wk "git")
  "gs" 'magit-status
  "gh" 'magit-diff-buffer-file
  "gm" '(:ignore t :wk "merge")
  "gmn" 'smerge-next
  "gmp" 'smerge-prev
  "gma" 'smerge-keep-all
  "gmc" 'smerge-keep-current
  "gmo" 'smerge-keep-other
)

#+end_src

