config.org
*** Help

#+begin_src emacs-lisp
(leader-set-keys
  "h" '(:ignore t :wk "hel")
  "hv" 'helpful-variable
  "hk" 'helpful-key
  "hf" 'helpful-function
  "ht" 'helpful-at-point
)

#+end_src
*** Jupyter
#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'python-mode "c" 'ein:worksheet-execute-cell-km)
(leader-set-keys-for-major-mode 'python-mode "n" 'ein:worksheet-insert-cell-below)
#+end_src
*** Macros
#+begin_src emacs-lisp
(leader-set-keys
  "K" '(:ignore t :wk "macros")
  "K" 'kmacro-call-macro)
#+end_src
*** Org

#+begin_src emacs-lisp
(leader-set-keys
  "o" '(:ignore t :wk "org-roam")
  "oa" '(:ignore t :wk "agenda")
  "oat" 'org-todo-list
  "oaT" 'org-todo-list-TODO
  "oaN" 'org-todo-list-NEXT
  "oaL" 'org-todo-list-LATER
  "oaW" 'org-todo-list-WAITING
  "oaB" 'org-agenda-BOARD
  "oal" 'org-agenda-list
  "oac" 'cfw:open-org-calendar
  "oar" 'org-agenda-refresh
  "ob" 'org-roam-buffer-toggle
  "of" 'org-roam-node-find
)

(defun org-fold-all-task-entries ()
  "Close/fold all entries marked that represent tasks."
  (interactive)
  (save-excursion
    (goto-char (point-max))
    (while (outline-previous-heading)
      (when (or (org-entry-is-todo-p) (org-entry-is-done-p))
        (hide-entry)))))

(leader-set-keys-for-major-mode 'org-mode "a" 'org-table-align)
(leader-set-keys-for-major-mode 'org-mode "t" 'org-todo)
(leader-set-keys-for-major-mode 'org-mode "f" 'org-fold-all-task-entries)
(leader-set-keys-for-major-mode 'org-mode "s" 'org-schedule)
(leader-set-keys-for-major-mode 'org-mode "d" 'org-deadline)
(leader-set-keys-for-major-mode 'org-mode "L" 'org-shiftright)
(leader-set-keys-for-major-mode 'org-mode "H" 'org-shiftleft)
(leader-set-keys-for-major-mode 'org-mode "K" 'org-shiftup)
(leader-set-keys-for-major-mode 'org-mode "J" 'org-shiftdown)
(leader-set-keys-for-major-mode 'org-mode "S" 'org-sort-entries)
(leader-set-keys-for-major-mode 'org-mode "it" 'org-insert-todo-heading)
(leader-set-keys-for-major-mode 'org-mode "in" 'org-roam-node-insert)
(leader-set-keys-for-major-mode 'org-mode "il" 'org-insert-link)
(leader-set-keys-for-major-mode 'org-mode "ic" 'mk/org-insert-src-block)
(leader-set-keys-for-major-mode 'org-mode "o" 'org-open-at-point)
(leader-set-keys-for-major-mode 'org-mode "j" 'counsel-imenu)
(leader-set-keys-for-major-mode 'org-mode "c" 'org-toggle-checkbox)


#+end_src

*** Projects

#+begin_src emacs-lisp
(leader-set-keys
  "/" 'counsel-rg
)

#+end_src

*** Python

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'python-mode "=" 'yapfify-buffer)

#+end_src

*** R

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'ess-r-mode "s" 'R)
(leader-set-keys-for-major-mode 'ess-r-mode "c" 'ess-eval-buffer)
(leader-set-keys-for-major-mode 'ess-r-mode "=" 'lsp-format-buffer)

#+end_src

*** Shell

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'shell-mode "h" 'counsel-shell-history)

#+end_src

*** Spelling

Correct spelling.

#+begin_src emacs-lisp
(leader-set-keys
  "S" '(:ignore t :wk "Spelling")
  "Sb" 'flyspell-buffer
  "Sc" 'flyspell-correct-wrapper
  "Sn" 'flyspell-goto-next-error
  "Sd" 'ispell-change-dictionary
)

#+end_src

Transient state for inserting Special characters. (äÄüÜöÖß)

#+begin_src emacs-lisp
(defhydra hydra-transient-special-characters (:timeout 4)
   "Insert special character"
   ("a" (mk/insert-character "ä") "ä")
   ("A" (mk/insert-character "Ä") "Ä")
   ("u" (mk/insert-character "ü") "ü")
   ("U" (mk/insert-character "Ü") "Ü")
   ("o" (mk/insert-character "ö") "ö")
   ("O" (mk/insert-character "Ö") "Ö")
   ("s" (mk/insert-character "ß") "ß")
   ("e" (mk/insert-character "€") "€")
  )

#+end_src

*** Substitution

#+begin_src emacs-lisp
(leader-set-keys
  "s" '(:ignore t :wk "subsitute")
  "se" '(evil-iedit-state/iedit-mode)
  "sr" 'sp-rewrap-sexp
  "sd" 'sp-splice-sexp
)

#+end_src

*** TeX

#+begin_src emacs-lisp
(leader-set-keys-for-major-mode 'latex-mode "c" 'latex/build)
(leader-set-keys-for-major-mode 'latex-mode "b" 'TeX-command-master)
(leader-set-keys-for-major-mode 'latex-mode "v" 'TeX-view)
(leader-set-keys-for-major-mode 'latex-mode "m" 'TeX-insert-macro)
(leader-set-keys-for-major-mode 'latex-mode "e" 'LaTeX-environment)
(leader-set-keys-for-major-mode 'latex-mode "l" 'TeX-error-overview)
(leader-set-keys-for-major-mode 'latex-mode "-" 'TeX-recenter-output-buffer)
(leader-set-keys-for-major-mode 'latex-mode "r" 'reftex-reference)
(leader-set-keys-for-major-mode 'latex-mode "s" 'LaTeX-section)
(leader-set-keys-for-major-mode 'latex-mode "C" 'reftex-citation)
(leader-set-keys-for-major-mode 'latex-mode "xb" 'latex/font-bold)
(leader-set-keys-for-major-mode 'latex-mode "xe" 'latex/font-emphasis)
(leader-set-keys-for-major-mode 'latex-mode "xi" 'latex/font-italic)
(leader-set-keys-for-major-mode 'latex-mode "xc" 'latex/font-code)
(leader-set-keys-for-major-mode 'latex-mode "xs" 'latex/font-small-caps)

(add-hook 'TeX-mode-hook (lambda ()
                           (leader-set-keys
                             "mj" 'lsp-ivy-workspace-symbol)))
#+end_src

*** Text

#+begin_src emacs-lisp
  (leader-set-keys
    "x" '(:ignore t :wk "text")
    "xp" 'fill-paragraph
    "xP" 'unfill-paragraph
    "xC" 'capitalize-word
    "xL" 'downcase-word
    "xT" 'titlecase-region
    "xa" 'accent-menu
    "xi" 'hydra-transient-special-characters/body
  )

#+end_src

*** Theme

#+begin_src emacs-lisp
(defcustom doom-theme-var "light"
   "Variable which sets the default startup theme as light or dark.
 Also allows for toggling of the themes.
 Defaults to nil."
   :group 'doom
   :type 'string)

 (defun mk/doom-toggle-theme ()
   "Function to interactively toggle between light and dark doom themes.
 Requires both to be loaded in order to work."
   (interactive)
   (cond ((string= doom-theme-var "light")
          (progn (load-theme 'doom-tomorrow-night t)
                 (setq doom-theme-var "dark")))
          ((string= doom-theme-var "dark")
          (progn (load-theme 'doom-tomorrow-day t)
                 (setq doom-theme-var "light")))
          (t nil))) 

  (leader-set-keys
    "T" '(:ignore t :wk "Theme")
    "Ts" 'mk/doom-toggle-theme
  )

#+end_src

*** Toggles

#+begin_src emacs-lisp
(leader-set-keys
  "t" '(:ignore t :wk "toggles")
  "ta" 'auto-fill-mode
  "tl" 'toggle-truncate-lines
)

#+end_src

*** Universal

#+begin_src emacs-lisp
(leader-set-keys
  "u" 'universal-argument
)

#+end_src

*** Windows

#+begin_src emacs-lisp
;; Transient state for window resizing
(defhydra hydra-transient-window-resize (:timeout 4)
  "resize window cyclically"
  ("+" mk/enlarge-window "enlarge window")
  ("-" mk/shrink-window "shrink window")
  ("=" balance-windows "balance windows")
  ("s" cycle-resize-window-vertically "resize vertically")
  ("v" cycle-resize-window-horizontally "resize horizontally"))

(leader-set-keys
  "w" '(:ignore t :wk "window")
  "wd" 'delete-window
  "wD" 'delete-other-windows
  "wv" 'split-and-follow-vertically
  "ws" 'split-and-follow-horizontally
  "wl" 'evil-window-right
  "wL" 'evil-window-move-far-right
  "wh" 'evil-window-left
  "wH" 'evil-window-move-far-left
  "wj" 'evil-window-down
  "wJ" 'evil-window-move-very-bottom
  "wk" 'evil-window-up
  "wK" 'evil-window-move-very-top
  "wt" 'mk/split-to-shell
  "wT" 'mk/split-to-shell-fullscreen
  "wr" 'hydra-transient-window-resize/body
  "ww" 'writeroom-mode
)

#+end_src

*** Zoom

#+begin_src emacs-lisp
(leader-set-keys
  "z" '(:ignore t :wk "zoom")
  "zx" 'text-scale-adjust
)

#+end_src
